# Brewfile for macOS applications and system tools

tap "maclong9/tap", "git@github.com/maclong9/tap.git"

# • Language Servers
brew "bash-language-server"
brew "harper"
brew "marksman"
brew "pkl-lsp"
brew "tinymist"
brew "typstyle"
brew "vscode-langservers-extracted"

# • CLI Tools & Utilities
brew "bat"
brew "deno"
brew "fzf"
brew "gh"
brew "helix"
brew "pkl"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "sls"
brew "typst"
brew "zoxide"

# • Applications (Casks)
cask "claude-code"
cask "container"
cask "onyx"
cask "rpcs3"
cask "ryujinx"
cask "steam"

# • Mac App Store Applications
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Wipr", id: 1662217862
mas "Xcode", id: 497799835
