# Brewfile for macOS applications and system tools

tap "maclong9/tap"

# System tools and utilities
brew "bash-language-server"
brew "bat"
brew "cloudflare-wrangler"
brew "deno"
brew "fzf"
brew "gh"
brew "harper"
brew "helix"
brew "marksman"
brew "mas"
brew "node"
brew "pkl-lsp"
brew "ripgrep"
brew "shellcheck"
brew "shfmt"
brew "swift" if OS.linux?
brew "usage"
brew "vscode-langservers-extracted"
brew "zoxide"

# Applications (Casks)
cask "claude-code"
cask "container"
cask "font-sf-mono-nerd-font-ligaturized"
cask "ghostty@tip"
cask "onyx"
cask "pcsx2"
cask "rpcs3"
cask "ryujinx"
cask "steam"

# Mac App Store applications
mas "Apple Configurator", id: 1037126344
mas "Compressor", id: 424390742
mas "Final Cut Pro", id: 424389933
mas "Keynote", id: 409183694
mas "Logic Pro", id: 634148309
mas "MainStage", id: 634159523
mas "Motion", id: 434290957
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "Urban VPN Desktop", id: 1517772049
mas "Windows App", id: 1295203466
mas "Wipr", id: 1662217862
mas "WireGuard", id: 1451685025
mas "Xcode", id: 497799835
